---
kind: method
id: M:Autodesk.Revit.DB.DoubleArray.#ctor
source: html/16e5cf46-d76c-1eb0-d024-be541503e792.htm
---
# Autodesk.Revit.DB.DoubleArray.#ctor Method

Initializes a new instance of the DoubleArray class

## Syntax (C#)
```csharp
public DoubleArray()
```